In [1]:
import pandas as pd
import matplotlib.pyplot as plt


lien_apple_un_an = "1y apple.csv"

df = pd.read_csv(lien_apple_un_an)
pd.to_datetime(df['Date'])
df.head()

         Date Close/Last    Volume     Open       High      Low
0  10/30/2023    $170.29  51130960  $169.02    $171.17  $168.87
1  10/27/2023    $168.22  58499130  $166.91    $168.96  $166.83
2  10/26/2023    $166.89  70625260  $170.37  $171.3775  $165.67
3  10/25/2023    $171.10  57156960  $171.88    $173.06  $170.65
4  10/24/2023    $173.44  43816640  $173.05    $173.67  $171.45

In [2]:
temps=df['Date']
high_auctions=df['High']
low_auctions=df['Low']

In [3]:
df.dtypes

#problème sur les types des données de chaque colonne : il y a un signe $ devant chaque donnée numérique

Date          object
Close/Last    object
Volume         int64
Open          object
High          object
Low           object
dtype: object

In [9]:

df['high new']=df['High'].str.replace('$','').astype(float)
df

,Date,Close/Last,Volume,Open,High,Low,high new
0,10/30/2023,$170.29,51130960,$169.02,$171.17,$168.87,171.1700
1,10/27/2023,$168.22,58499130,$166.91,$168.96,$166.83,168.9600
2,10/26/2023,$166.89,70625260,$170.37,$171.3775,$165.67,171.3775
3,10/25/2023,$171.10,57156960,$171.88,$173.06,$170.65,173.0600
4,10/24/2023,$173.44,43816640,$173.05,$173.67,$171.45,173.6700
...,...,...,...,...,...,...,...
1252,11/06/2018,$50.9425,127098880,$50.48,$51.18,$50.4225,51.1800
1253,11/05/2018,$50.3975,264288680,$51.075,$51.0975,$49.5425,51.0975
1254,11/02/2018,$51.87,364186240,$52.3875,$53.4125,$51.3575,53.4125
1255,11/01/2018,$55.555,211816280,$54.7625,$55.59,$54.2025,55.5900
1256,10/31/2018,$54.715,152067240,$54.22,$55.1125,$54.155,55.1125